# -*- coding: utf-8 -*-
require 'matrix'

#初期設定
$z = [162.1746, 139.5805, 113.8133, 94.3372, 74.7258,   59.3817,  41.4117,  26.5951, 20.1832,   8.8816,   1.8636,   -5.0213, -5.8861,   -5.7711,  -4.9332,  -1.9845, 2.0593,    12.3849,  17.9044,  30.1826, 41.1677,   55.7128,  74.2944,  93.7607, 112.6638,  134.9818, 162.7143, 188.9610, 219.6236,  248.9036, 281.3082 ]
$size = $z.size

#推定誤差共分散初期値
p_start = 1000000.0
x = Matrix[[0.0], [0.0], [0.0]]
p = Matrix.scalar(3, p_start)
sigma   = [4.0, 1.0]
$size.times do |i|
	k = i-15
	h = Matrix[[1, k, k**2]]
	r = Matrix[[sigma[k%2]]]
	#観測予測誤差共分散
	s = h * p * h.transpose + r
	#フィルタゲイン
	w = p * h.transpose * s.inverse
	#推定値の算出
	x = x + w * (Matrix[[$z[i]]] - h * x)
  puts x
	#puts x.to_a[0]
	#推定誤差共分散の更新
	p = p - w * s * w.transpose
end


#puts  x
